ИС_СПОРТ_2022/src/InformationRegisters/СоставУчащихсяСпортивногоУчреждения/СоставУчащихсяСпортивногоУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоставУчащихсяСпортивногоУчреждения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпортаУдалить</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/InformationRegisters/ЭтапыСпортивнойПодготовкиСпортсменов/ЭтапыСпортивнойПодготовкиСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭтапыСпортивнойПодготовкиСпортсменов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </resources>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыСпортивнойПодготовки</types>
    </type>
  </resources>
  <resources>
    <name>СпортивнаяПрограмма</name>
    <type>
      <types>CatalogRef.СпортивныеПрограммы</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапУдалить</name>
    <type>
      <types>CatalogRef.ЭтапыСпортивнойПодготовки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпортивнаяПрограммаУдалить</name>
    <type>
      <types>CatalogRef.СпортивныеПрограммы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/AccumulationRegisters/КоличествоВидовСпортаТренеров/КоличествоВидовСпортаТренеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КоличествоВидовСпортаТренеров</name>
  <resources>
    <name>КоличествоТренеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВидаСпорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИС_СПОРТ_2022/src/Documents/ВводВидаСпортаВручную/ВводВидаСпортаВручную.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводВидаСпортаВручную</name>
  <registerRecords>AccumulationRegister.КоличествоВидовСпортаТренеров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВидаСпорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/УдалениеВидаСпортаВручную/УдалениеВидаСпортаВручную.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УдалениеВидаСпортаВручную</name>
  <registerRecords>AccumulationRegister.КоличествоВидовСпортаТренеров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияВидаСпорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ИС_СПОРТ_2022/src/CommonForms/ФормаВводаВидаСпортаДляТренера/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Отбор.Организация);
    Список.Параметры.УстановитьЗначениеПараметра("Тренер", Параметры.Отбор.Тренер);
	
	ОрганизацияСсылка = Параметры.Отбор.Организация;
	ТренерСсылка 	  = Параметры.Отбор.Тренер;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ДобавитьВидСпортаНаСервере(Результат, Дата) Экспорт
	
	// {Рарус adilas #21986 -Вид спорта введенный вручную 2021.11.15	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		|	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		|	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта
		|ПОМЕСТИТЬ ВТ_СоставУчащихся
		|ИЗ
		|	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(, Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		|ГДЕ
		|	(СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения > &ТекущаяДата
		|			ИЛИ СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1))
		|	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта = &ВидСпорта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Спортсмен,
		|	Организация,
		|	ВидСпорта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭтапыСпортивнойПодготовкиСпортсменовСрезПоследних.Организация КАК Организация,
		|	ЭтапыСпортивнойПодготовкиСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		|	ЭтапыСпортивнойПодготовкиСпортсменовСрезПоследних.Спортсмен КАК Спортсмен
		|ПОМЕСТИТЬ ВТ_Этапы
		|ИЗ
		|	РегистрСведений.ЭтапыСпортивнойПодготовкиСпортсменов.СрезПоследних(
		|			,
		|			(Спортсмен, ВидСпорта) В
		|				(ВЫБРАТЬ
		|					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен,
		|					ВТ_СоставУчащихся.ВидСпорта КАК ВидСпорта
		|				ИЗ
		|					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ЭтапыСпортивнойПодготовкиСпортсменовСрезПоследних
		|ГДЕ
		|	ЭтапыСпортивнойПодготовкиСпортсменовСрезПоследних.Тренер = &Тренер
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Организация,
		|	ВидСпорта,
		|	Спортсмен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Этапы.ВидСпорта КАК ВидСпорта
		|ИЗ
		|	ВТ_Этапы КАК ВТ_Этапы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СоставУчащихся КАК ВТ_СоставУчащихся
		|		ПО (ВТ_СоставУчащихся.Организация = ВТ_Этапы.Организация)
		|			И (ВТ_СоставУчащихся.ВидСпорта = ВТ_Этапы.ВидСпорта)
		|			И (ВТ_СоставУчащихся.Спортсмен = ВТ_Этапы.Спортсмен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КоличествоВидовСпортаТренеровОстатки.ВидСпорта КАК ВидСпорта
		|ИЗ
		|	РегистрНакопления.КоличествоВидовСпортаТренеров.Остатки(, Тренер = &Тренер) КАК КоличествоВидовСпортаТренеровОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.КоличествоВидовСпортаТренеров КАК КоличествоВидовСпортаТренеров
		|		ПО КоличествоВидовСпортаТренеровОстатки.Организация = КоличествоВидовСпортаТренеров.Организация
		|			И КоличествоВидовСпортаТренеровОстатки.ВидСпорта = КоличествоВидовСпортаТренеров.ВидСпорта
		|			И КоличествоВидовСпортаТренеровОстатки.Тренер = КоличествоВидовСпортаТренеров.Тренер
		|			И КоличествоВидовСпортаТренеровОстатки.ДатаВидаСпорта = КоличествоВидовСпортаТренеров.ДатаВидаСпорта
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(КоличествоВидовСпортаТренеров.Регистратор) = ТИП(Документ.ВводВидаСпортаВручную)
		|	И КоличествоВидовСпортаТренеров.Регистратор.Проведен
		|	И КоличествоВидовСпортаТренеров.Регистратор.ПометкаУдаления = ЛОЖЬ
		|	И КоличествоВидовСпортаТренеров.Регистратор.Проведен
		|	И КоличествоВидовСпортаТренеров.Регистратор.ПометкаУдаления = ЛОЖЬ
		|	И КоличествоВидовСпортаТренеровОстатки.ВидСпорта = &ВидСпорта";
	// }Рарус adilas #21986 -Вид спорта введенный вручную 2021.11.15	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());	
	Запрос.УстановитьПараметр("ВидСпорта", Результат);
	Запрос.УстановитьПараметр("Организация", ОрганизацияСсылка);
	Запрос.УстановитьПараметр("Тренер", ТренерСсылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ОтсутствуетПоЗачислению = "";
	ОтсутствуетПоКоличествуВидов = "";
	
	тзВидыСпортаПоЭтапам = РезультатЗапроса[2].Выгрузить();
	тзКоличествоВидовСпорта = РезультатЗапроса[3].Выгрузить();
	
	Если тзВидыСпортаПоЭтапам.Количество() = 0 Тогда
		ОтсутствуетПоЗачислению = Истина;
	Иначе
		ОтсутствуетПоЗачислению = Ложь;
	КонецЕсли;
	
	Если тзКоличествоВидовСпорта.Количество() = 0 Тогда
		ОтсутствуетПоКоличествуВидов = Истина;
	Иначе
		ОтсутствуетПоКоличествуВидов = Ложь;
	КонецЕсли;
		
	Если ОтсутствуетПоЗачислению И ОтсутствуетПоКоличествуВидов Тогда
		
		НовыйДокументВидСпортаВручную = Документы.ВводВидаСпортаВручную.СоздатьДокумент();
	
		НовыйДокументВидСпортаВручную.Дата 				  = ТекущаяДатаСеанса();
		НовыйДокументВидСпортаВручную.Организация 		  = ОрганизацияСсылка;
		НовыйДокументВидСпортаВручную.Тренер 			  = ТренерСсылка;
		НовыйДокументВидСпортаВручную.ВидСпорта 		  = Результат;
		// {Рарус adilas #21986 -Вид спорта введенный вручную 2021.11.15
		НовыйДокументВидСпортаВручную.ДатаВводаВидаСпорта = Дата;
		// }Рарус adilas #21986 -Вид спорта введенный вручную 2021.11.15			
		НовыйДокументВидСпортаВручную.Записать(РежимЗаписиДокумента.Проведение);

	ИначеЕсли ОтсутствуетПоЗачислению И (ОтсутствуетПоКоличествуВидов = Ложь) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Данный вид спорта уже добавлен вручную!'"));	
	ИначеЕсли ОтсутствуетПоКоличествуВидов И (ОтсутствуетПоЗачислению = Ложь) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Данный вид спорта уже добавлен путем зачисления спортсменов на этап!'"));
	ИначеЕсли (ОтсутствуетПоЗачислению = Ложь) И (ОтсутствуетПоКоличествуВидов = Ложь) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Данный вид спорта уже добавлен путем зачисления спортсменов на этап и уже добавлен вручную!'"));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Данное действие невозможно!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВидСпортаНаСервере(Строка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Спортсмен КАК Спортсмен,
		|	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.Организация КАК Организация,
		|	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта КАК ВидСпорта,
		|	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения КАК ДатаОкончанияОбучения
		|ПОМЕСТИТЬ ВТ_СоставУчащихся
		|ИЗ
		|	РегистрСведений.СоставУчащихсяСпортивногоУчреждения.СрезПоследних(, Организация = &Организация) КАК СоставУчащихсяСпортивногоУчрежденияСрезПоследних
		|ГДЕ
		|	СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ДатаОкончанияОбучения = ДАТАВРЕМЯ(1, 1, 1)
		|	И СоставУчащихсяСпортивногоУчрежденияСрезПоследних.ВидСпорта = &ВидСпорта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Спортсмен,
		|	Организация,
		|	ВидСпорта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭтапыСпортивнойПодготовкиСпортсменовСрезПоследних.Организация КАК Организация,
		|	ЭтапыСпортивнойПодготовкиСпортсменовСрезПоследних.ВидСпорта КАК ВидСпорта,
		|	ЭтапыСпортивнойПодготовкиСпортсменовСрезПоследних.Спортсмен КАК Спортсмен,
		|	ЭтапыСпортивнойПодготовкиСпортсменовСрезПоследних.Регистратор.ДатаЗачисления КАК ДатаЗачисления
		|ИЗ
		|	РегистрСведений.ЭтапыСпортивнойПодготовкиСпортсменов.СрезПоследних(
		|			,
		|			(Спортсмен, ВидСпорта) В
		|				(ВЫБРАТЬ
		|					ВТ_СоставУчащихся.Спортсмен КАК Спортсмен,
		|					ВТ_СоставУчащихся.ВидСпорта КАК ВидСпорта
		|				ИЗ
		|					ВТ_СоставУчащихся КАК ВТ_СоставУчащихся)) КАК ЭтапыСпортивнойПодготовкиСпортсменовСрезПоследних
		|ГДЕ
		|	ЭтапыСпортивнойПодготовкиСпортсменовСрезПоследних.Тренер = &Тренер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КоличествоВидовСпортаТренеровОстатки.ВидСпорта КАК ВидСпорта
		|ИЗ
		|	РегистрНакопления.КоличествоВидовСпортаТренеров.Остатки(
		|			,
		|			Тренер = &Тренер
		|				И ВидСпорта = &ВидСпорта) КАК КоличествоВидовСпортаТренеровОстатки";
	
	Запрос.УстановитьПараметр("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидСпорта", Строка.ВидСпорта);
	Запрос.УстановитьПараметр("Организация", ОрганизацияСсылка);
	Запрос.УстановитьПараметр("Тренер", ТренерСсылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	тзВидыСпортаПоЭтапам = РезультатЗапроса[1].Выгрузить();
	тзКоличествоВидовСпорта = РезультатЗапроса[2].Выгрузить();
		
	ЕстьПоЗачислению = "";
	ЕстьПоКоличествуВидов = "";
	
	Если тзВидыСпортаПоЭтапам.Количество() > 0 Тогда
		ЕстьПоЗачислению = Истина;
	Иначе
		ЕстьПоЗачислению = Ложь;
	КонецЕсли;
	
	Если тзКоличествоВидовСпорта.Количество() > 0 Тогда
		ЕстьПоКоличествуВидов = Истина;
	Иначе
		ЕстьПоКоличествуВидов = Ложь;
	КонецЕсли;

	Если ЕстьПоЗачислению И (ЕстьПоКоличествуВидов = Ложь) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='У тренера есть зачисленные спортсмены на этап!'"));
			
	ИначеЕсли ЕстьПоЗачислению И ЕстьПоКоличествуВидов Тогда
		
		НовыйДокументУдалениеВидаСпортаВручную = Документы.УдалениеВидаСпортаВручную.СоздатьДокумент();
		
		НовыйДокументУдалениеВидаСпортаВручную.Дата 				  = ТекущаяДатаСеанса();
		НовыйДокументУдалениеВидаСпортаВручную.Организация 			  = ОрганизацияСсылка;
		НовыйДокументУдалениеВидаСпортаВручную.Тренер				  = ТренерСсылка;
		НовыйДокументУдалениеВидаСпортаВручную.ВидСпорта 			  = Строка.ВидСпорта;
		НовыйДокументУдалениеВидаСпортаВручную.ДатаУдаленияВидаСпорта = Строка.ДатаВидаСпорта;
		
		НовыйДокументУдалениеВидаСпортаВручную.Записать(РежимЗаписиДокумента.Проведение); 
		
	ИначеЕсли (ЕстьПоЗачислению = Ложь) И ЕстьПоКоличествуВидов Тогда
		
		НовыйДокументУдалениеВидаСпортаВручную = Документы.УдалениеВидаСпортаВручную.СоздатьДокумент();
		
		НовыйДокументУдалениеВидаСпортаВручную.Дата 				  = ТекущаяДатаСеанса();
		НовыйДокументУдалениеВидаСпортаВручную.Организация 			  = ОрганизацияСсылка;
		НовыйДокументУдалениеВидаСпортаВручную.Тренер 				  = ТренерСсылка;
		НовыйДокументУдалениеВидаСпортаВручную.ВидСпорта 			  = Строка.ВидСпорта;
		НовыйДокументУдалениеВидаСпортаВручную.ДатаУдаленияВидаСпорта = Строка.ДатаВидаСпорта;
		
		НовыйДокументУдалениеВидаСпортаВручную.Записать(РежимЗаписиДокумента.Проведение); 
		
	Иначе
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Данное действие не возможно! Обратитесь к администратору'"));
		
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВидаСпорта(Результат, ПараметрыКоманды) Экспорт	
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		
		Возврат;
		
	Иначе
		
		Подсказка = НСтр("ru='Введите дату'");
		
		ДополнительныеПараметры = Новый Структура;
	    ДополнительныеПараметры.Вставить("Результат", Результат); 	
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораДаты", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВводДаты(ОписаниеОповещения, УчетСпортсменовВызовСервера.ТекущаяДатаНаСервере(), Подсказка, ЧастиДаты.Дата);
		
	КонецЕсли;
 
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДаты(ДатаВвода, ДополнительныеПараметры) Экспорт
	
	Если НЕ ДатаВвода = Неопределено Тогда
		Дата = ДатаВвода;
	Иначе
		Дата = УчетСпортсменовВызовСервера.ТекущаяДатаНаСервере();
	КонецЕсли;
	
	ДобавитьВидСпортаНаСервере(ДополнительныеПараметры.Результат, Дата);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВидСпорта(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораВидаСпорта", ЭтотОбъект);	
	ПоказатьВводЗначения(Оповещение, , НСтр("ru='Выберете вид спорта'"), Новый ОписаниеТипов("СправочникСсылка.ВидыСпорта"));
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВидСпорта(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные.Свойство("ВидСпорта") Тогда
	
		УдалитьВидСпортаНаСервере(ТекущиеДанные);
		Элементы.Список.Обновить();
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Выберите вид спорта для удаления!'"));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
